// клас для обслуживания игровой модели
//
// алгоритм игры:
// создаем модель
// запускаем таймер
//
// можем изменять положение фигуры и спускать ее в низ
//
// проверяем по истечению таймера статус игры
// спускаем фигуру на шаг в низ

export default class GameServices {

  // создание модели
  public getModel(columns: number, rows: number){
    return []
  }

  //проверка модели на ПРОИГРЫШ
  //GAME OVER

  //проверка модели на ПОБЕДУ
  //удаление заполненной строки

  //переход на следующий шаг

  //спускаем модель в низ

  //событие того что фигура опустилась на основание


}
