/** Типы фигур */
export const enum Figure {
  /**
   *
   *   []
   *   []
   * [][]
   *
   * */
  J = 0,

  /**
   *
   *   []
   *   []
   *   []
   *   []
   *
   * */
  I = 1,

  /**
   *
   *   [][]
   *   [][]
   *
   * */
  O = 2,

  /**
   *
   *   []
   *   []
   *   [][]
   *
   * */
  L = 3,

  /**
   *
   * [][]
   *   [][]
   *
   * */
  Z = 4,

  /**
   *   []
   * [][][]
   *
   * */
  T = 5,

  /**
   *
   *     [][]
   *   [][]
   *
   * */
  S = 6,
}

/** Положение фигур по часовой чтрелки*/
export const enum FigurePosition {
  First = 0,
  Second = 1,
  Third = 2,
  Fourth = 3,
}
